using System;
//Задача 3. Сформировав квадратную целочисленную матрицу со случайными значениями элементов,
//упорядочить ее строки по возрастанию сумм их элементов. Пусть элементы принимают значения в диапазоне от –50 до +50.
class Task3
{
    static void Main()
    {
        Console.Write("Размер матрицы N: ");
        int n = int.Parse(Console.ReadLine());

        int[,] a = new int[n, n];
        Random rnd = new Random();

        // Заполнение матрицы и подсчет сумм строк
        for (int i = 0; i < n; i++)
        {
            for (int j = 0; j < n; j++)
            {
                a[i, j] = rnd.Next(-50, 51); //Пусть элементы принимают значения в диапазоне от –50 до +50.
            }
        }

        // упорядочить ее строки по возрастанию сумм их элементов. 
        int[,] b = new int[n, n];
        int[] summStr = new int[n]; //исходная сумма каждой строки
        for (int i = 0; i < n; i++)
        {
            for (int j = 0; j < n; j++)
            {
                summStr[i] += a[i, j];
                b[i,j ] = a[i, j];  
            }
        }

        Console.WriteLine("\nИсходная матрица:");
        for (int i = 0; i < n; i++)
        {
            for (int j = 0; j < n; j++) Console.Write($"{a[i, j]} \t");
            Console.Write($" = {summStr[i]} \n");
        }

        // Упорядочиваем строки матрицы по возрастанию сумм (Пузырек)
        for (int i = 0; i < n - 1; i++) // Внешний цикл отвечает за количество проходов по массиву
        {
            for (int j = 0; j < n - 1 - i; j++) // Внутренний цикл бежит по строкам сверху вниз
            {
                if (summStr[j] > summStr[j + 1]) // Если сумма текущей строки больше суммы следующей
                {
                    // Шаг 1. Меняем местами суммы в одномерном массиве summStr
                    int tempSum = summStr[j];
                    summStr[j] = summStr[j + 1];
                    summStr[j + 1] = tempSum;

                    // Шаг 2. Меняем местами сами элементы строк в матрице b
                    for (int k = 0; k < n; k++) // Цикл k перебирает все столбцы (от 0 до n) в этих двух строках
                    {
                        int tempVal = b[j, k];         // Запоминаем элемент верхней строки (строка j, столбец k)
                        b[j, k] = b[j + 1, k];         // На место верхнего ставим элемент из нижней строки (строка j+1)
                        b[j + 1, k] = tempVal;         // На место нижнего ставим сохраненный верхний элемент
                    }
                }
            }
        }

        Console.WriteLine("Итоговый массив: ");
        for (int i = 0; i < n; i++)
        {
            for (int j = 0; j < n; j++) Console.Write($"{b[i, j]} \t");
            Console.Write($" = {summStr[i]} \n");
        }
    }
}