using System;
//Задача 6. Определить вещественный массив из 10-ти элементов.
//Присвоить элементам случайные значения из диапазона [–10, 10).
//Сформировать массив индексов, которые нумеруют элементы первого массива в порядке возрастания их значений
class Task6
{
    static void Main()
    {
        double[] a = new double[10]; //Определить вещественный массив из 10-ти элементов.
        int[] idx = new int[10]; //массив индексов, которые нумеруют элементы первого массива в порядке возрастания их значений
        Random rnd = new Random();

        for (int i = 0; i < 10; i++)
        {
            a[i] = rnd.NextDouble() * 20 -10; //Присвоить элементам случайные значения из диапазона [–10, 10).  rnd.NextDouble() знач от 0.00...1 до 0.99
            idx[i] = i;
            Console.WriteLine($"[{i}] = {a[i]:F2}");
        }

        // Сортировка индексов по значениям массива
        for (int i = 0; i < 9; i++) //накой это условие, поч не поменять j < 9 - i
            for (int j = 0; j < 9 - i; j++) //j обнуляеться при i++, Один проход внутреннего цикла перемещает всего один самый большой элемент в самый конец массива
                if (a[idx[j]] > a[idx[j + 1]])
                {
                    //меняем местами эл-ты
                    int temp = idx[j]; //чтоб не потерять эл-нт
                    idx[j] = idx[j + 1];
                    idx[j + 1] = temp;
                }
        Console.WriteLine($"Индексы по возрастанию: {string.Join(", ", idx)}");
    }
}